src/test/load/artillery/system/put-tests/full-put-tests.yaml
config:
  payload:
    # path is relative to the location of the test script
    # path: "test-objects-tiny.csv"
    - path: "../test-objects-gr-1.csv"
      fields:
        - "id"
        - "creationTime"
        - "ttl"
        - "value"
    - path: "../../hosts.csv"
      order: sequence
      fields:
        - "host"
  target: http://192.168.0.150:6898
  phases:
    - duration: 10
      arrivalRate: 5
    - duration: 20
      arrivalRate: 8
    - duration: 30
      arrivalRate: 50
    - duration: 300
      arrivalRate: 100

scenarios:
  - name: peer-1
    weight: 1
    flow:
      - post:
          url: "http://{{ host }}/nomad/storage/put"
          json:
            id: "{{ id }}"
            creationTime: "{{ creationTime }}"
            ttl: "{{ ttl }}"
            value: "EDq8apUZJ1W/JSVP2ozRtGT8IfxK7KpwMpBaR6hO1sgezIw9ksj6wS5PqU78C7uRTyZgHYf9sxFHU+G0kHeDVZP4DiKy0MuPCO1MDxOr6fs+u2AzJt2RPo3/7Lp00LTnOv28FCzfc43Wjy59+BAHTvtOhRjXIfykuYrVIxBDqX/P8z9pgylMDl7rusK60LrY3dU2naO9gZZ62rd47n6PtefZBJtlO9owpiYKwUScfsYmT6Lt/bmVI2m+b3LwrOzPar2A34ea6MfBG6BkGsB0TuAKsQeRVL6yn9kyt1GAIYW+nYue8wUaLDB4IuO9MY77LCXyyK/gZxJftmIvykqJq3ZVfsBx/vV2bTRZ32o+0a52En4dw7O8PkFU2SJx8MdCVDzLUeXg8fIGPtoFFirp6cQIfZYSW9IGapqfK0dSf8ytyhJV9p19JZOuTG1iTiMjFEplL2qfVrPOMDDsxdgiWMHSVMH8ufvuIdtgQE9aMpeIFn+PbfCvzbBC4IHt2qcESVTs8J2SzYU3z/caTeOl/U982YGQjqFuvFzvWhM9hdUsuOGuB/SdBgN5TYrXSRRBJ78TrtF5zsgVR3N2jDwvYGrK3pPLMsDpNnoGSqdbR6HPFxW3k3BdmwdxRY+KHNIV2ToKD50113rUVCqJIYl7+ChNm4u1OS2MRmmlMlBwkcJPvBu7oBrik/drqd2ExVvoZjCil5MaJSs56rGnZMLW7wfXITnEDfnk3xIjsdyypbwNk+YO/eUMVaEnUtfjFbzBNgZAfIEkmxEO+BTryDBX9eCvcftyukVcylsEC/X5Wo8Ff+ICrUmH0diNXeH3IKn1JMOAzKMBK7mtuw7ujiEJ1Vif4QqKY7dnv8h0fR4WGBEKBYX59XFNlj9jYuEXbNgUmGTJlOxdXl2el4DjcXOxqaoZ6UtBSX20+lKslpFhkrvWDNg83hFTNyyXtV1ogVEtI5urxbP/T2rstNQ6+hKuuomK9Nm5qQfOLRLwJqEzeOTPkCUzkrkkEDEaidPXpakeAKDZIMadAPZVzqO4lJwJAiOQOhDx2If5SlM1biiHazU7HRs1fsk+3SNA5a7dhHkdvAcrN39q74+o2BKQBYilDHWTyrI8QRN7yJH+qYIOj7Ly2+hDzv/10rnyB6IH62Hvs9Erp6VennO+r6M6yDhVLi9/skAYLgjUUP0JWg2PXZT4DJGIgPTdrDppCLlevzKrimeleDwqUc4WzLj+C61gBO8CSDhVT0hzZNkKNaLVbjQ6BEZAbJ5B9hd1llXXXGM1EQPoIX7gGCQmQehRCtdIhkw+bVkRcZuojKsdMlwZ9W7ZLCcVaQPNpZPLtldIeqBQTW/zn4HpcRBmuM9Ra/YYEQ=="